<a href="https://colab.research.google.com/github/Lewis34cs/fb_prophet_blog_notebook/blob/main/cleaning_dataset_prophetBlog.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Mounting Google Drive
from google.colab import drive
drive.mount('/content/drive', force_remount=True)

Mounted at /content/drive

In [2]:
#Importing necessary libraries
import pandas as pd

This dataset was retrieved from Kaggle and then uploaded into my Google Drive.

Link to the original dataset can be found [`here`](https://www.kaggle.com/djokester/sales-of-shampoo-over-a-three-year-period)

The purpose of this notebook is to clean the shampoo dataset and save the cleaned dataset as a new csv file. 

To view and download the cleaned csv file, please visit my [`Github page`](https://github.com/Lewis34cs/fb_prophet_blog_notebook)

In [16]:
# Loading in dataset
df = pd.read_csv('/content/drive/MyDrive/gdrive/datasets/shampoo_sales.csv')

### Cleaning data for easier use

We notice that the 'Month' column contains a format of year-month, however the year is only one number. In order for Prophet to correctly understand what the date is, we need to change up the 'Month' column.

In [17]:
df.head(13)

   Month  Sales of shampoo over a three year period
0   1-01                                      266.0
1   1-02                                      145.9
2   1-03                                      183.1
3   1-04                                      119.3
4   1-05                                      180.3
5   1-06                                      168.5
6   1-07                                      231.8
7   1-08                                      224.5
8   1-09                                      192.8
9   1-10                                      122.9
10  1-11                                      336.5
11  1-12                                      185.9
12  2-01                                      194.3

In [18]:
# Setting an arbitrary number for year in 'Month' column
df['Month'] = '200' + df['Month']

In [19]:
df.tail()

                                           Month  Sales of shampoo over a three year period
32                                       2003-09                                      682.0
33                                       2003-10                                      475.3
34                                       2003-11                                      581.3
35                                       2003-12                                      646.9
36  200Sales of shampoo over a three year period                                        NaN

In [20]:
# Dropping row 36 -> has no relevant information for time series modeling
df.drop(index=36, axis=0, inplace=True)

In [21]:
# Setting column names to required column names to be able to work with Prophet
df.columns = ['ds', 'y']

In [22]:
# Setting 'ds' column as a datetime object
df['ds'] = pd.to_datetime(df['ds'], format='%Y-%m-%d')

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 36 entries, 0 to 35
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ds      36 non-null     datetime64[ns]
 1   y       36 non-null     float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 864.0 bytes

In [24]:
df.head()

          ds      y
0 2001-01-01  266.0
1 2001-02-01  145.9
2 2001-03-01  183.1
3 2001-04-01  119.3
4 2001-05-01  180.3

In [12]:
# Saving the dataframe to a csv file
df.to_csv('/content/drive/MyDrive/gdrive/datasets/shampoo_timeseries.csv', index=False)